constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet_fluid
    {
        type            patch;
        nFaces          56;
        startFace       271634;
    }
    outlet_fluid
    {
        type            patch;
        nFaces          56;
        startFace       271690;
    }
    walls_fluid
    {
        type            patch;
        nFaces          1596;
        startFace       271746;
    }
    fluid_to_fins
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          42568;
        startFace       273342;
        sampleMode      nearestPatchFace;
        sampleRegion    fins;
        samplePatch     fins_to_fluid;
    }
)

// ************************************************************************* //
