constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet_fluid
    {
        type            patch;
        nFaces          56;
        startFace       468354;
    }
    outlet_fluid
    {
        type            patch;
        nFaces          56;
        startFace       468410;
    }
    walls_fluid
    {
        type            patch;
        nFaces          1596;
        startFace       468466;
    }
    walls_heater
    {
        type            patch;
        nFaces          320;
        startFace       470062;
    }
    base_fins
    {
        type            patch;
        nFaces          1104;
        startFace       470382;
    }
)

// ************************************************************************* //
