constant/heater/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/heater";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

energySource
{
    type            heatSource;

    selectionMode   all;

    q               2.94e7;
    //Q				56.64;
}

/*
energySource
    {
        type            semiImplicitSource;
        
        selectionMode   all;
        
        volumeMode		specific;
    	
    	sources
    	{
    	    e
    	    {
    	        explicit 2.94e7;
    	        implicit 0;
    	    }
    	}
    }
*/
// ************************************************************************* //
