system/fluid/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    limitT
    {
		type            limitTemperature;
        selectionMode          all;
        //field           T;   // Optional energy/temperature field name
                                // Set to T for compressibleVoF
        //phase           gas; // Optional phase name
        min             270;
        max             350;
    }

// ************************************************************************* //
